domain/wheelcase/hpc1_velo_changed/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    frontAndBack
    {
        type            patch;
        nFaces          320;
        startFace       1097864;
    }
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       1098184;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       1098248;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1153;
        startFace       1098312;
    }
    upperWall
    {
        type            patch;
        nFaces          160;
        startFace       1099465;
    }
    veloMain
    {
        type            wall;
        inGroups        
2
(
veloGroup
wall
)
;
        nFaces          21260;
        startFace       1099625;
    }
    veloTop
    {
        type            wall;
        inGroups        
2
(
veloGroup
wall
)
;
        nFaces          3186;
        startFace       1120885;
    }
    veloWheelcase
    {
        type            wall;
        inGroups        
2
(
veloGroup
wall
)
;
        nFaces          7661;
        startFace       1124071;
    }
)

// ************************************************************************* //
